rails_studio/flix_2/app/controllers/reviews_controller.rb

def set_movie
  @movie = Movie.find_by(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE (2) LIMIT 1